In [1]:
import pandas as pd
orders_df = pd.read_csv('../Landing/orders/orders.csv')
orders_df.head(10)

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id,extract_time,source
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2,2024-04-28 18:44:54.651800,postgres
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6,2024-04-28 18:44:54.651800,postgres
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7,2024-04-28 18:44:54.651800,postgres
3,4,175,4,2016-01-03,2016-01-04,2016-01-05,1,3,2024-04-28 18:44:54.651800,postgres
4,5,1324,4,2016-01-03,2016-01-06,2016-01-06,2,6,2024-04-28 18:44:54.651800,postgres
5,6,94,4,1016-01-04,1016-01-07,1016-01-05,2,6,2024-04-28 18:44:54.651800,postgres
6,7,324,4,1016-01-04,1016-01-07,1016-01-05,2,6,2024-04-28 18:44:54.651800,postgres
7,8,1204,4,1016-01-04,1016-01-05,1016-01-05,2,7,2024-04-28 18:44:54.651800,postgres
8,9,60,4,1016-01-05,1016-01-08,1016-01-08,1,2,2024-04-28 18:44:54.651800,postgres
9,10,442,4,1016-01-05,1016-01-06,1016-01-06,2,6,2024-04-28 18:44:54.651800,postgres

In [2]:
#check nulls
orders_df.isnull().sum()

order_id           0
customer_id        0
order_status       0
order_date         0
required_date      0
shipped_date     170
store_id           0
staff_id           0
extract_time       0
source             0
dtype: int64

In [3]:
# i will assume if shipped_date = null then the order isn't shipped yet 
orders_df['shipped_date'].fillna('not yet', inplace=True)

In [4]:
#check nulls
orders_df.isnull().sum()

order_id         0
customer_id      0
order_status     0
order_date       0
required_date    0
shipped_date     0
store_id         0
staff_id         0
extract_time     0
source           0
dtype: int64

In [5]:
orders_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1615 entries, 0 to 1614
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       1615 non-null   int64
 1   customer_id    1615 non-null   int64
 2   order_status   1615 non-null   int64
 3   order_date     1615 non-null   object
 4   required_date  1615 non-null   object
 5   shipped_date   1615 non-null   object
 6   store_id       1615 non-null   int64
 7   staff_id       1615 non-null   int64
 8   extract_time   1615 non-null   object
 9   source         1615 non-null   object
dtypes: int64(5), object(5)
memory usage: 126.3+ KB

In [16]:
orders_df.isnull().sum()

order_id           0
customer_id        0
order_status       0
order_date        11
required_date      0
shipped_date     170
store_id           0
staff_id           0
extract_time       0
source             0
dtype: int64

In [8]:
orders_df['order_date'] = pd.to_datetime(orders_df['order_date'], errors='coerce')
# Filter rows where the year is between 2000 and 2024
orders_df = orders_df[(orders_df['order_date'].dt.year >= 2000) & (orders_df['order_date'].dt.year <= 2024)]

In [9]:
orders_df.isnull().sum()

order_id         0
customer_id      0
order_status     0
order_date       0
required_date    0
shipped_date     0
store_id         0
staff_id         0
extract_time     0
source           0
dtype: int64

In [13]:
orders_df['order_date'].min()

Timestamp('2016-01-01 00:00:00')

In [14]:
orders_df['order_date'].max()

Timestamp('2018-12-28 00:00:00')

In [17]:
#check dublicates
duplicates = orders_df.duplicated('order_id')
duplicates

0       False
1       False
2       False
3       False
4       False
        ...
1610    False
1611    False
1612    False
1613    False
1614    False
Length: 1604, dtype: bool

In [18]:
unique_count = orders_df['order_id'].nunique()
unique_count

1604

In [19]:
orders_df.shape

(1604, 10)

In [20]:
orders_df.to_csv('../Staging/orders/orders.csv',index=False)